Tekla Open API Reference for Tekla Structures 2025
ProfileItem.aProfileItemCrossSections Property
Note: This API is now obsolete.
 An array list with the profile item cross-sections.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Deprecated. Please use ProfileItemCrossSections instead.")]
public ArrayList aProfileItemCrossSections { get; }
<ObsoleteAttribute("Deprecated. Please use ProfileItemCrossSections instead.")>
Public ReadOnly Property aProfileItemCrossSections As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace